@extends('front.layout')


@section('style')

@endsection

@section('content')
<main style="background-color:#fafafa; padding:3px">

    <div class="clearfix mx-auto" style="width:1200px; ">

        <h1 class="content-title" style="padding-top: 20px;">Ба муаллимон</h1>

        <div style="background: #fff;
    box-shadow: 0 7px 10px rgba(0,0,0,0.2);">
            <div class="w-75 mx-auto my-5 py-5">
                <p class="p my-3">Ҳамкорони азиз!</p>

                <p class="p my-3"> Ҳар як дарси интерактивии мактаби мо натиҷаи саъю кӯшиши тамоми дастаи мутахассисон мебошад, ки ба кори худ ошиқанд. Дар ҳоле ки мактаб дар режими тестӣ кор мекунад. Лутфан воситаҳои фикру мулоҳизаро барои мубодилаи афкори худ, пешниҳод кардани роҳҳои ҳалли ҷолиб ва ё гузориш додани ҳама гуна мушкилот истифода баред! </p>

                <p class="p my-3"> Дарсҳои интерактивӣ видеои кӯтоҳро бо лексияи муаллим, вазифаҳо ва машқҳо барои мустаҳкам намудани дониш ва малакаҳои амалӣ, инчунин супоришҳои тестӣ оид ба назорати азхудкунии маводро дар бар мегиранд. Машқҳо ва вазифаҳоро шумораи номаҳдуд иҷро кардан мумкин аст, онҳо баҳогузорӣ ва ҳатто бештар гузоштани баҳоро дар назар надоранд. Супоришҳои тестӣ, баръакс, супоридани такрорро дар назар надоранд - система натиҷаҳои иҷрои онҳоро аз ҷониби корбарони сабтшуда сабт мекунад ва дар ин замина омори пешрафти донишҷӯён ташаккул меёбад. </p>

                <p class="p my-3">Видеоҳо бо маърӯзаҳои муаллимон бо тасвирҳо, порчаҳо аз филмҳои мустанад ва бадеӣ, файлҳои аудиоӣ, нусхаҳои ҳуҷҷатҳои бойгонӣ ва ғайра илова карда мешаванд. Маводи иловагӣ барои дарсҳо аз ҷониби шарикони Мактаби электронии Тоҷикистон пешниҳод карда мешавад ва танҳо барои корбарони сабтиномшуда дастрасанд. Ҳамаи ин маводҳо танҳо барои мақсадҳои таълимӣ бо риояи пурраи Қонунҳои Ҷумҳурии Тоҷикистон истифода мешаванд. </p>

                <p class="p my-3">Муаллимони мӯҳтарам, шумо метавонед аз захираҳои таълимии "Мактаби электронии Тоҷикистон" на танҳо ҳангоми ташкили дарсҳо дар синф, ҳамчун маводи иловагӣ, балки ҳамчун роҳи омӯхтани таҷриба ва кори ҳамкасбон низ истифода баред. Дар ин ҷо шумо барномаи корӣ барои ҳар як мавзӯъ, ёддоштҳои дарс, машқҳо ва санҷишҳоро дар мавзӯъ пайдо мекунед. Лабораторияҳои пешниҳодшуда нишон медиҳанд, ки қонунҳое, ки шумо дар синф таълим медиҳед, дар амал чӣ гуна амал мекунанд.
                </p>

                <p class="p my-3"> Мазмуни маводҳои дидактикӣ ва таълимии мо ба стандартҳои таҳсилоти федералии давлатӣ ва барномаҳои тахминии ибтидоии таҳсилоти ибтидоии умумӣ, асосии умумӣ, миёнаи умумӣ пурра мувофиқат мекунад, ки бо натиҷаи имтиҳони мустақил тасдиқ карда мешавад. Шумо метавонед ба шогирдони худ тавсия диҳед, ки дар дарсҳои онлайн ва маводи иловагии мактаби электронӣ барои баланд бардоштани сифати дониши худ, инчунин омодагӣ ба корҳои санҷишии Маркази Миллии Тестӣ назди Президенти Ҷумҳурии Тоҷикистон истифода баранд. Усули ҳамгирошуда ба таълим ба шогирдони шумо кӯмак мекунад, ки барномаи таълимии мактабро бомуваффақият аз худ кунанд ва ба нишондиҳандаҳои баланди таълимӣ ноил шаванд.</p>

                <p class="p my-3"> Хуш омадед ба Мактаби электронии Тоҷикистон! </p>

            </div>
        </div>
    </div>
    <div class="banner-contain block-shadow wrapper-content">
    </div>
</main>
@endsection


@section('script')

@endsection
