<?php

namespace App\Http\Controllers;

class InfoController extends Controller
{

    private $info = [
        'for-school' => [
            'title' => 'Ба мактабҳо',
            'body' => 'Ҳамкорон, хуш омадед ба Мактаби электронии Тоҷикистон!

Дар "Мактаби электронии Тоҷикистон" шумо маҷмӯи пурраи ҳуҷҷатҳои таълимию методӣ барои ташкили фаъолияти таълимӣ дар ҳамаи фанҳои таълимии аз синфҳои 1 то 11-ро пайдо мекунед. Маводҳои дидактикӣ ва методӣ, ки дар феҳристи мактаб ҷойгир карда шудаанд, метавонанд барои омода сохтани омӯзгорони шумо ва инчунин бевосита дар синф истифода шаванд, ки ин ба афзоиши таваҷҷӯҳи хонандагон ба маводи омӯхташуда мусоидат мекунад.

Мазмуни ҳамаи маводҳои пешниҳодшуда пурра ба стандартҳои таҳсилоти федералии давлатӣ ва барномаҳои тахминии ибтидоии таълими ибтидоии умумӣ, асосии умумӣ, миёнаи умумӣ мувофиқат мекунанд, ки бо натиҷаи имтиҳони мустақил тасдиқ карда мешавад. Супоришҳо ва машқҳо барои мустаҳкам кардани мавзӯъ дар фанҳои таълимӣ, санҷиш ва арзёбии дониши донишҷӯён дар дарсҳои интерактивӣ бо назардошти хусусиятҳои супоришҳои корҳои тестии умумиТоҷикистон ва аттестатсияи ниҳоии давлатӣ дар шакли OGE ва USE дода мешаванд. Маводи назорати ченкунӣ ва супоришҳои тестӣ барои ҳамаи фанҳои таълимӣ дар соҳаи ҷамъият ҷойгир карда мешаванд ва ҳамасола нав карда мешаванд.

Мактаби электронии Тоҷикистон барои мактабҳои хурд ёрдамчии воқеӣ хоҳад шуд, ки дар онҳо камбуди шадиди омӯзгорон вуҷуд дорад - дарсҳои пешниҳодшудаи интерактивӣ метавонанд муваққатан ва дар ҳолати зарурӣ набудани муаллимро дар ягон фанни таълимӣ пурра ҷуброн кунанд.

Мо муаллимон ва мутахассисони ҷавонро барои "ташриф" ба дарсҳои кушоди муаллимони беҳтарин аз беҳтарин мактабҳои кишвар даъват мекунем. Ин табодули таҷриба роҳи дастрастарини баланд бардоштани тахассуси касбии шумо хоҳад буд.'
        ],
        'for-parent' => [
            'title' => 'Ба волидайн',
            'body' => 'Волидони азиз!

                Оё шумо мехоҳед, ки фарзандатон дар мактаб бо шавқ таҳсил кунад ва мустақилона вазифаи хонагиро иҷро кунад? То ки дар бораи натиҷаи таҳсил ғам нахӯранд ва муносибат бо кӯдакон эътимоди бештар пайдо кунанд? Боварӣ дорем, ки ҳар яки шумо ба ин саволҳо ба таври мусбат посух хоҳед дод.

                Ҳоло шумо аз ташвиши ноороми кӯдак ё дарсҳои аз сабаби беморӣ ба дарс нагузашта хавотир намешавед: ҳар як донишҷӯ имконият дорад, ки барои азхуд кардани мавод якчанд маротиба дарси интерактивиро тамошо кунад. Донишҷӯёни мактабҳои миёна метавонанд мавзӯъҳои омӯхташударо ҳангоми омодагӣ ба имтиҳон мустақилона такрор кунанд. Холи баланд дар натиҷаи имтиҳон ҳадафи дилхоҳи донишҷӯён ва волидони онҳост. Синфҳои муназзам дар "Мактаби электронии Тоҷикистон" ба рушди қобилиятҳои зеҳнӣ ва эҷодии кӯдакон, азхудкунии пурраи дониш дар мавзӯъҳои таълимӣ мусоидат намуда, ба шумо имкон медиҳанд, ки малакаҳои зарурии амалиро ба даст оред ва ба омодагӣ ба сертификатсияи ниҳоии давлатӣ - OGE ва USE кӯмак расонед.

                "Мактаби электронии Тоҷикистон" беҳтарин кадрҳои омӯзгории кишвар, технологияҳои муосири таълим, дарсҳои ҷолиби интерактивӣ мебошад. Барномаи таълимии мактаб пурра ба стандартҳои давлатии таҳсилоти федералӣ ва барномаҳои ибтидоии намунавӣ мувофиқат мекунад ва мундариҷаи ташаккулёфтаро ба таври бехатар метавон беназир номид. Ҳама корбарони сабтиномшуда (донишҷӯён ва волидон) ба маводи иловагӣ (пораҳо аз филмҳои мустанад ва бадеӣ, намоишҳои телевизионӣ, асарҳои мусиқӣ, нусхаҳои ҳуҷҷатҳои бойгонӣ ва ғ.), Ки аз ҷониби муаллимони мактаби мо махсус барои ҳар касе, ки мехоҳад дониши худро дар самтҳои гуногун амиқтар кунад, интихоб кардаанд, дастрасӣ доранд.

                Кӯдакони муосир дар як рӯз якчанд соатро дар назди компютерҳо ва дастгоҳҳои мобилӣ мегузаронанд. Биёед онҳоро ба роҳи дуруст равона кунем. Истифодаи салоҳиятноки компютерҳо дар таълим ба фаъолшавии фаъолияти зеҳнӣ мусоидат намуда, дар аксарияти донишҷӯён ҳавасмандии мусбатро барои дарсҳо ташаккул медиҳад, ба афзоиши ҳаҷми иттилооти гирифташуда ва тафаккур ба низом медарояд.

                Агар дар бораи комилан гузаштан ба таълими оилавӣ ё худомӯзӣ тасмим гирифта шавад, тавсия медиҳем, ки ҳам фарзандон ва ҳам волидон дар портали "Мактаби электронии Тоҷикистон" сабти ном шаванд - ин имкон медиҳад, ки барномаи таълимии инфиродӣ сохта шуда, татбиқи он аз ҷониби фарзанди шумо танзим карда шавад.

                Фаромӯш накунед, ки кӯдакон пеш аз дохил шудан ба ягон мактаб бояд аз муоинаи тиббӣ гузаранд. Ва барои оғози дарсҳо дар "Мактаби электронии Тоҷикистон" ба шумо низ лозим аст, ки ба педиатр муроҷиат кунед. Илтимос дар хотир гиред, ки миопияи баланд, эпилепсия ва эпилептиформ нишондиҳандаҳои асосии кор бо компютер ва дигар дастгоҳҳои электронӣ мебошанд.

                Воқеан, барои вуруд ба "Мактаби электронии Тоҷикистон" маҳдудият вуҷуд надорад: на аз рӯи синну сол - мо ҳам ба кӯдакон ва ҳам ба калонсолон хушҳол хоҳем шуд; на дар ҷои истиқомат - мо ҳама, аз ҷумла онҳое, ки аз дигар кишварҳо даъват карда мешаванд; сари вақт не - омӯзед, вақте ки он ба шумо мувофиқ аст.

                Ба шумо муваффақият мехоҳем!

                '],
        'for-teacher' => [
            'title' => 'Ба муаллимон',
            'body' => 'Ҳамкорони азиз!

                Ҳар як дарси интерактивии мактаби мо натиҷаи саъю кӯшиши тамоми дастаи мутахассисон мебошад, ки ба кори худ ошиқанд. Дар ҳоле ки мактаб дар режими тестӣ кор мекунад. Лутфан воситаҳои фикру мулоҳизаро барои мубодилаи афкори худ, пешниҳод кардани роҳҳои ҳалли ҷолиб ва ё гузориш додани ҳама гуна мушкилот истифода баред!

                Дарсҳои интерактивӣ видеои кӯтоҳро бо лексияи муаллим, вазифаҳо ва машқҳо барои мустаҳкам намудани дониш ва малакаҳои амалӣ, инчунин супоришҳои тестӣ оид ба назорати азхудкунии маводро дар бар мегиранд. Машқҳо ва вазифаҳоро шумораи номаҳдуд иҷро кардан мумкин аст, онҳо баҳогузорӣ ва ҳатто бештар гузоштани баҳоро дар назар надоранд. Супоришҳои тестӣ, баръакс, супоридани такрорро дар назар надоранд - система натиҷаҳои иҷрои онҳоро аз ҷониби корбарони сабтшуда сабт мекунад ва дар ин замина омори пешрафти донишҷӯён ташаккул меёбад.

                Видеоҳо бо маърӯзаҳои муаллимон бо тасвирҳо, порчаҳо аз филмҳои мустанад ва бадеӣ, файлҳои аудиоӣ, нусхаҳои ҳуҷҷатҳои бойгонӣ ва ғайра илова карда мешаванд. Маводи иловагӣ барои дарсҳо аз ҷониби шарикони Мактаби электронии Тоҷикистон пешниҳод карда мешавад ва танҳо барои корбарони сабтиномшуда дастрасанд. Ҳамаи ин маводҳо танҳо барои мақсадҳои таълимӣ бо риояи пурраи Қонунҳои Ҷумҳурии Тоҷикистон истифода мешаванд.

                Муаллимони мӯҳтарам, шумо метавонед аз захираҳои таълимии "Мактаби электронии Тоҷикистон" на танҳо ҳангоми ташкили дарсҳо дар синф, ҳамчун маводи иловагӣ, балки ҳамчун роҳи омӯхтани таҷриба ва кори ҳамкасбон низ истифода баред. Дар ин ҷо шумо барномаи корӣ барои ҳар як мавзӯъ, ёддоштҳои дарс, машқҳо ва санҷишҳоро дар мавзӯъ пайдо мекунед. Лабораторияҳои пешниҳодшуда нишон медиҳанд, ки қонунҳое, ки шумо дар синф таълим медиҳед, дар амал чӣ гуна амал мекунанд.

                Мазмуни маводҳои дидактикӣ ва таълимии мо ба стандартҳои таҳсилоти федералии давлатӣ ва барномаҳои тахминии ибтидоии таҳсилоти ибтидоии умумӣ, асосии умумӣ, миёнаи умумӣ пурра мувофиқат мекунад, ки бо натиҷаи имтиҳони мустақил тасдиқ карда мешавад. Шумо метавонед ба шогирдони худ тавсия диҳед, ки дар дарсҳои онлайн ва маводи иловагии мактаби электронӣ барои баланд бардоштани сифати дониши худ, инчунин омодагӣ ба корҳои санҷишии Маркази Миллии Тестӣ назди Президенти Ҷумҳурии Тоҷикистон истифода баранд. Усули ҳамгирошуда ба таълим ба шогирдони шумо кӯмак мекунад, ки барномаи таълимии мактабро бомуваффақият аз худ кунанд ва ба нишондиҳандаҳои баланди таълимӣ ноил шаванд.

                Хуш омадед ба Мактаби электронии Тоҷикистон!

            '
        ],
        'for-pupil' => [
            'title' => 'Ба талабаҳо',
            'body' => 'Бачаҳои азиз!

                Мо як хабари олӣ дорем: мактаб мобилӣ шудааст ва ба осонӣ дар компютерҳо ва планшетҳои шумо ҷой мегирад. Ҳоло шумо худатон таҳсилро ташкил мекунед, фанҳоятонро интихоб мекунед, бо беҳтарин муаллимони кишвар таҳсил мекунед. Ҳама чиз оддӣ, дастрас ва ҷолиб аст!

                Оё ба шумо лозим аст, ки зуд маводро пеш аз санҷиш баррасӣ кунед? Фаромӯш кардед, ки муаллим дар бораи чӣ сухан меронд? Аҷабо, дар синфи навбатӣ чӣ мегузарад? Сипас:

                🔘 ба сафҳаи мактаби мо гузаред;

                🔘 синф, фан ва мавзӯъро интихоб кунед;

                🔘 муаллимро бодиққат гӯш кунед (лексияҳо кӯтоҳанд!);

                🔘 аз рӯи машқҳо ва вазифаҳои худ машқ кунед;

                🔘 санҷед, ки оё шумо бо истифодаи супоришҳои тестӣ ҳама чизро аз ёд кардаед.

                Дар ин ҷо ҳама метавонанд дониши худро оид ба фанҳои таълимӣ такмил диҳанд. Барномаи "Мактаби электронии Тоҷикистон" ба стандартҳои таҳсилоти федералии давлатӣ комилан мувофиқат мекунад, аз ин рӯ озодона истифода баред, то маводҳои дарсҳоро барои омодагӣ ба санҷишҳо, санҷишҳои умумӣ, имтиҳонҳо дар шакли OGE ва Имтиҳони ягонаи давлатӣ истифода баред. Шумо ба бонки супоришҳое, ки дар имтиҳонҳои солҳои гузашта истифода шуда буданд, дастрасӣ доред.

                Машқҳо ва санҷишҳо дар дарсҳо аз рӯи намуди санҷишҳои имтиҳонӣ дода мешаванд. Шумо идора кардани вақти худро меомӯзед, зеро шумо мефаҳмед, ки кадом вазифаҳо саъй ва диққати бештарро талаб мекунанд.

                Барои ин бақайдгирӣ талаб карда намешавад.

                Ҷаҳон пур аз асрор ва асрорест, ки беҳтарин муаллимони кишвар дар ҳалли он ба шумо кумак мекунанд. Бо ҳавас омӯзед! Кашф кардани чизи нав дар ошно ва ғайримуқаррарӣ дар оддӣ! Бигзор дониши дар Мактаби электронии Тоҷикистон гирифташуда ба шумо дар мубориза бо ҳар гуна шароити зиндагӣ кумак кунад, уфуқҳои навро барои рушди қобилиятҳо боз кунад, дар бораи эҷодиёт ғояҳо пешкаш кунад, ба шумо дар интихоби касб кумак кунад, ба имтиҳони ягонаи давлатӣ пас аз синфҳои 9 ва 11 омода шавед.

                Боварӣ дорем, ки ин ба шумо писанд хоҳад омад. Мактаби электронии Тоҷикистон мактаби бидуни марз, мактаби имконоти номаҳдуд аст!

                Ба шумо дар таҳсил муваффақият мехоҳем!
                '
        ]
    ];

    public function show($slug)
    {
        $data = $this->info[$slug];
        return view('front.pages.info', compact('data'));
    }

    public function about()
    {
        return view('front.pages.about');
    }
}
